AlmAck/svdtonuttx/demo/h/da1470_gpio.h
#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_12_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_13_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_14_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_15_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_16_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_17_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_18_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_19_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_20_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P0_21_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

