AlmAck/svdtonuttx/demo/h/da1470_gpio.h
/* P0_RESET_DATA Register */

#define P0_RESET_MASK                         (0xFFFFFFFF << 0) /* Writing a 1 to P0[y] sets P0[y] to 0. Writing 0 is discarded; Reading returns 0 */
#define P0_RESET_POS                          (0) /* Writing a 1 to P0[y] sets P0[y] to 0. Writing 0 is discarded; Reading returns 0 */

/* P0_SET_DATA Register */

#define P0_SET_MASK                           (0xFFFFFFFF << 0) /* Writing a 1 to P0[y] sets P0[y] to 1. Writing 0 is discarded; Reading returns 0 */
#define P0_SET_POS                            (0) /* Writing a 1 to P0[y] sets P0[y] to 1. Writing 0 is discarded; Reading returns 0 */

/* P0_WEAK_CTRL Register */

#define P0_31_LOWDRV                          (1U << 31) /* 0 = Normal operation 1 = Reduces the driving strength of P0_31 pad Note: This mo */
#define P0_30_LOWDRV                          (1U << 30) /* 0 = Normal operation 1 = Reduces the driving strength of P0_30 pad Note: This mo */
#define P0_29_LOWDRV                          (1U << 29) /* 0 = Normal operation 1 = Reduces the driving strength of P0_29 pad Note: This mo */
#define P0_28_LOWDRV                          (1U << 28) /* 0 = Normal operation 1 = Reduces the driving strength of P0_28 pad Note: This mo */
#define P0_27_LOWDRV                          (1U << 27) /* 0 = Normal operation 1 = Reduces the driving strength of P0_27 pad Note: This mo */
#define P0_24_LOWDRV                          (1U << 24) /* 0 = Normal operation 1 = Reduces the driving strength of P0_24 pad Note: This mo */
#define P0_23_LOWDRV                          (1U << 23) /* 0 = Normal operation 1 = Reduces the driving strength of P0_23 pad Note: This mo */
#define P0_22_LOWDRV                          (1U << 22) /* 0 = Normal operation 1 = Reduces the driving strength of P0_22 pad Note: This mo */
#define P0_21_LOWDRV                          (1U << 21) /* 0 = Normal operation 1 = Reduces the driving strength of P0_21 pad Note: This mo */
#define P0_20_LOWDRV                          (1U << 20) /* 0 = Normal operation 1 = Reduces the driving strength of P0_20 pad Note: This mo */
#define P0_19_LOWDRV                          (1U << 19) /* 0 = Normal operation 1 = Reduces the driving strength of P0_19 pad Note: This mo */
#define P0_18_LOWDRV                          (1U << 18) /* 0 = Normal operation 1 = Reduces the driving strength of P0_18 pad Note: This mo */
#define P0_17_LOWDRV                          (1U << 17) /* 0 = Normal operation 1 = Reduces the driving strength of P0_17 pad Note: This mo */
#define P0_16_LOWDRV                          (1U << 16) /* 0 = Normal operation 1 = Reduces the driving strength of P0_16 pad Note: This mo */
#define P0_15_LOWDRV                          (1U << 15) /* 0 = Normal operation 1 = Reduces the driving strength of P0_15 pad Note: This mo */
#define P0_14_LOWDRV                          (1U << 14) /* 0 = Normal operation 1 = Reduces the driving strength of P0_14 pad Note: This mo */
#define P0_11_LOWDRV                          (1U << 11) /* 0 = Normal operation 1 = Reduces the driving strength of P0_11 pad Note: This mo */
#define P0_10_LOWDRV                          (1U << 10) /* 0 = Normal operation 1 = Reduces the driving strength of P0_10 pad Note: This mo */
#define P0_09_LOWDRV                          (1U << 9) /* 0 = Normal operation 1 = Reduces the driving strength of P0_09 pad Note: This mo */
#define P0_08_LOWDRV                          (1U << 8) /* 0 = Normal operation 1 = Reduces the driving strength of P0_08 pad Note: This mo */
#define P0_07_LOWDRV                          (1U << 7) /* 0 = Normal operation 1 = Reduces the driving strength of P0_07 pad Note: This mo */
#define P0_06_LOWDRV                          (1U << 6) /* 0 = Normal operation 1 = Reduces the driving strength of P0_06 pad Note: This mo */
#define P0_05_LOWDRV                          (1U << 5) /* 0 = Normal operation 1 = Reduces the driving strength of P0_05 pad Note: This mo */
#define P0_04_LOWDRV                          (1U << 4) /* 0 = Normal operation 1 = Reduces the driving strength of P0_04 pad Note: This mo */
#define P0_03_LOWDRV                          (1U << 3) /* 0 = Normal operation 1 = Reduces the driving strength of P0_03 pad Note: This mo */
#define P0_02_LOWDRV                          (1U << 2) /* 0 = Normal operation 1 = Reduces the driving strength of P0_02 pad Note: This mo */
#define P0_01_LOWDRV                          (1U << 1) /* 0 = Normal operation 1 = Reduces the driving strength of P0_01 pad Note: This mo */
#define P0_00_LOWDRV                          (1U << 0) /* 0 = Normal operation 1 = Reduces the driving strength of P0_00 pad Note: This mo */

/* P1_00_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_01_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_02_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_03_MODE Register */

