AlmAck/svdtonuttx/demo/h/da1470_gpio.h
#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_26_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_27_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_28_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_29_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_30_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_31_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P1_DATA Register */

#define P1_DATA_MASK                          (0xFFFFFFFF << 0) /* Set P1 output register when written; Returns the value of P1 port when read */
#define P1_DATA_POS                           (0) /* Set P1 output register when written; Returns the value of P1 port when read */

/* P1_PADPWR_CTRL Register */

#define P1_31_OUT_CTRL                        (1U << 31) /* 0 = P1_31 port output is powered by the V30 rail (default) 1 = P1_31 port output */
#define P1_30_OUT_CTRL                        (1U << 30) /* 0 = P1_30 port output is powered by the V30 rail (default) 1 = P1_30 port output */
#define P1_27_OUT_CTRL                        (1U << 27) /* 0 = P1_27 port output is powered by the V30 rail (default) 1 = P1_27 port output */
#define P1_26_OUT_CTRL                        (1U << 26) /* 0 = P1_26 port output is powered by the V30 rail (default) 1 = P1_26 port output */
#define P1_25_OUT_CTRL                        (1U << 25) /* 0 = P1_25 port output is powered by the V30 rail (default) 1 = P1_25 port output */
#define P1_24_OUT_CTRL                        (1U << 24) /* 0 = P1_24 port output is powered by the V30 rail (default) 1 = P1_24 port output */
#define P1_23_OUT_CTRL                        (1U << 23) /* 0 = P1_23 port output is powered by the V30 rail (default) 1 = P1_23 port output */
#define P1_22_OUT_CTRL                        (1U << 22) /* 0 = P1_22 port output is powered by the V30 rail (default) 1 = P1_22 port output */
#define P1_20_OUT_CTRL                        (1U << 20) /* 0 = P1_20 port output is powered by the V30 rail (default) 1 = P1_20 port output */
#define P1_19_OUT_CTRL                        (1U << 19) /* 0 = P1_19 port output is powered by the V30 rail (default) 1 = P1_19 port output */
#define P1_15_OUT_CTRL                        (1U << 15) /* 0 = P1_15 port output is powered by the V30 rail (default) 1 = P1_15 port output */
#define P1_14_OUT_CTRL                        (1U << 14) /* 0 = P1_14 port output is powered by the V30 rail (default) 1 = P1_14 port output */
#define P1_13_OUT_CTRL                        (1U << 13) /* 0 = P1_13 port output is powered by the V30 rail (default) 1 = P1_13 port output */
#define P1_12_OUT_CTRL                        (1U << 12) /* 0 = P1_12 port output is powered by the V30 rail (default) 1 = P1_12 port output */
#define P1_11_OUT_CTRL                        (1U << 11) /* 0 = P1_11 port output is powered by the V30 rail (default) 1 = P1_11 port output */
#define P1_07_OUT_CTRL                        (1U << 7) /* 0 = P1_07 port output is powered by the V30 rail (default) 1 = P1_07 port output */
#define P1_06_OUT_CTRL                        (1U << 6) /* 0 = P1_06 port output is powered by the V30 rail (default) 1 = P1_06 port output */
#define P1_05_OUT_CTRL                        (1U << 5) /* 0 = P1_05 port output is powered by the V30 rail (default) 1 = P1_05 port output */
#define P1_04_OUT_CTRL                        (1U << 4) /* 0 = P1_04 port output is powered by the V30 rail (default) 1 = P1_04 port output */
#define P1_03_OUT_CTRL                        (1U << 3) /* 0 = P1_03 port output is powered by the V30 rail (default) 1 = P1_03 port output */
#define P1_01_OUT_CTRL                        (1U << 1) /* 0 = P1_01 port output is powered by the V30 rail (default) 1 = P1_01 port output */
#define P1_00_OUT_CTRL                        (1U << 0) /* 0 = P1_00 port output is powered by the V30 rail (default) 1 = P1_00 port output */

/* P1_RESET_DATA Register */

#define P1_RESET_MASK                         (0xFFFFFFFF << 0) /* Writing a 1 to P1[y] sets P1[y] to 0. Writing 0 is discarded; Reading returns 0 */
#define P1_RESET_POS                          (0) /* Writing a 1 to P1[y] sets P1[y] to 0. Writing 0 is discarded; Reading returns 0 */

/* P1_SET_DATA Register */

#define P1_SET_MASK                           (0xFFFFFFFF << 0) /* Writing a 1 to P1[y] sets P1[y] to 1. Writing 0 is discarded; Reading returns 0 */
#define P1_SET_POS                            (0) /* Writing a 1 to P1[y] sets P1[y] to 1. Writing 0 is discarded; Reading returns 0 */

