AlmAck/svdtonuttx/demo/h/da1470_gpio.h
/* P2_05_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_06_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_07_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_08_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_09_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_10_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_11_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_12_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_13_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_14_MODE Register */

#define PPOD                                  (1U << 10) /* 0: Push pull 1: Open drain */
#define PUPD_MASK                             (0x3 << 8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PUPD_POS                              (8) /* 00 = Input, no resistors selected 01 = Input, pull-up selected 10 = Input, pull- */
#define PID_MASK                              (0x3F << 0) /* See P0_00_MODE_REG[PID] */
#define PID_POS                               (0) /* See P0_00_MODE_REG[PID] */

/* P2_DATA Register */

#define P2_DATA_MASK                          (0x7FFF << 0) /* Set P2 output register when written; Returns the value of P2 port when read */
#define P2_DATA_POS                           (0) /* Set P2 output register when written; Returns the value of P2 port when read */

/* P2_PADPWR_CTRL Register */

